content/notes/the_flaws_of_capitalism.md
+++
title = "The flaws of capitalism"
author = ["Alex Koen"]
lastmod = 2021-04-29T21:07:26-07:00
draft = false
+++

Capitalism is an effective economic system with several flawed assumptions, notably that the creation of profit is directly tied to the improvement of people's lives.


## Tragedy of the commons {#tragedy-of-the-commons}

Say that a river has a fixed number of fish. The fisherman would collectively prosper if they enforced catch limits for each boat to prevent over-fishing. Yet each individual fisherman profits the most if they catch as many fish as possible, leading to a situation known as the _tragedy of the commons_ where the fish die out because of collective greed.

This is why socialist regulations are important. Corporations profit immensely in the short run by disrespecting the environment, for example, but will collectively suffer once resources are depleted.


## Inelastic demand {#inelastic-demand}

Healthcare demand, for example, does not vary as a function of price. If the alternative is to die, people will pay anything to get their insulin and so pharmaceutical companies can fix their prices arbitrarily high. Again, governmental regulations are necessary in these cases to prioritize the well-being of the people over profits.
